app/Controllers/KaryawanController.php

    public function kelolakaryawan()
    {
        $karyawan = new KaryawanModel();
        $data['karyawan'] = $karyawan->findAll();
---
SELECT *
FROM `karyawan`