app/Controllers/Login.php

    public function auth()
    {
        $session = session(); // Memulai sesi
        $model = new LoginModel(); // Membuat instance dari LoginModel
        $username = $this->request->getVar('username'); // Mendapatkan nilai 'username' dari request
        $password = $this->request->getVar('password'); // Mendapatkan nilai 'password' dari request
        $data = $model->where('username', $username)->first(); // Mencari data pengguna berdasarkan 'username'
---
SELECT *
FROM `login`
WHERE `username` = 'bagian_perlengkapan'
 LIMIT 1