app/Controllers/PenerimaanController.php

SELECT *
FROM `atkheader`
WHERE `tgl_permintaan` >= '2024-07-10'
AND `tgl_permintaan` <= '2024-07-10'
SELECT *
FROM `atkdetail`
WHERE `id_header` = '77'
AND `status` = 'done'
---
    public function penerimaan()
    {
        $session = session();

        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        $session->set('start_date', $startDate);
        $session->set('end_date', $endDate);

        $headerModel = new AtkHeaderModel();
        $detailModel = new AtkDetailModel();

        $headerData = $headerModel->where('tgl_permintaan >=', $startDate)
                                   ->where('tgl_permintaan <=', $endDate)
                                   ->findAll();

        $atkData = [];
        foreach ($headerData as $header) {
            $details = $detailModel->where('id_header', $header['id_header'])
                                   ->where('status', 'done')
                                   ->findAll();

SELECT *
FROM `atkheader`
WHERE `tgl_permintaan` >= '2024-07-10'
AND `tgl_permintaan` <= '2024-07-10'
SELECT *
FROM `atkdetail`
WHERE `id_header` = '77'
AND `status` = 'done'
---
    public function generatePdf()
{
    $session = session();

    $startDate = $session->get('start_date');
    $endDate = $session->get('end_date');

    $headerModel = new AtkHeaderModel();
    $detailModel = new AtkDetailModel();

    $headerData = $headerModel->where('tgl_permintaan >=', $startDate)
                               ->where('tgl_permintaan <=', $endDate)
                               ->findAll();

    $atkData = [];
    foreach ($headerData as $header) {
        $details = $detailModel->where('id_header', $header['id_header'])
                               ->where('status', 'done')
                               ->findAll();