app/Controllers/PermintaanatkController.php

SELECT *
FROM `atkheader`
WHERE `tgl_permintaan` >= '2024-05-04'
AND `tgl_permintaan` <= '2024-08-01'
SELECT *
FROM `atkdetail`
WHERE `id_header` = '65'
---
    public function generateReport()
    {
        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        $headerModel = new AtkHeaderModel();
        $detailModel = new AtkDetailModel();

        $headers = $headerModel->where('tgl_permintaan >=', $startDate)
                               ->where('tgl_permintaan <=', $endDate)
                               ->findAll();

        $data = [];
        foreach ($headers as $header) {
            $details = $detailModel->where('id_header', $header['id_header'])->findAll();

SELECT *
FROM `atkheader`
WHERE `tgl_permintaan` >= '2024-05-04'
AND `tgl_permintaan` <= '2024-08-01'
SELECT *
FROM `atkdetail`
WHERE `id_header` = '65'
---
    public function exportPdf() {
        // Memperpanjang waktu eksekusi PHP
        ini_set('max_execution_time', 300); // 300 detik (5 menit)

        // Ambil data dari form atau request
        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        // Ambil data dari model (disesuaikan dengan model dan data yang Anda gunakan)
        $headerModel = new AtkHeaderModel();
        $detailModel = new AtkDetailModel();

        $headers = $headerModel->where('tgl_permintaan >=', $startDate)
                               ->where('tgl_permintaan <=', $endDate)
                               ->findAll();

        $data = [];
        foreach ($headers as $header) {
            $details = $detailModel->where('id_header', $header['id_header'])->findAll();