app/Models/AtkModel.php

SELECT COUNT(*) AS `numrows` FROM `atk`
---
    public function getTotalJenisAtk()
    {
        return $this->countAll();